html-reports/endurance/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 35203,
    "errorCount" : 854,
    "errorPct" : 2.4259295,
    "meanResTime" : 3.6037553617589344,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 90.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 10.9900000000016,
    "throughput" : 58.77138211164943,
    "receivedKBytesPerSec" : 39.30019006466388,
    "sentKBytesPerSec" : 6.960546706745779
  },
  "01 - Product List" : {
    "transaction" : "01 - Product List",
    "sampleCount" : 11744,
    "errorCount" : 294,
    "errorPct" : 2.503406,
    "meanResTime" : 3.667915531335158,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 90.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 12.0,
    "throughput" : 19.60659919663696,
    "receivedKBytesPerSec" : 23.703364494884656,
    "sentKBytesPerSec" : 2.2214611363530126
  },
  "02 - Search Products" : {
    "transaction" : "02 - Search Products",
    "sampleCount" : 11736,
    "errorCount" : 285,
    "errorPct" : 2.4284253,
    "meanResTime" : 3.544989775051116,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 74.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 11.0,
    "throughput" : 19.613053309201387,
    "receivedKBytesPerSec" : 7.832877386455363,
    "sentKBytesPerSec" : 2.4831916427686895
  },
  "03 - Product Detail" : {
    "transaction" : "03 - Product Detail",
    "sampleCount" : 11723,
    "errorCount" : 275,
    "errorPct" : 2.345816,
    "meanResTime" : 3.59831101253945,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 82.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 11.0,
    "throughput" : 19.60840068511481,
    "receivedKBytesPerSec" : 7.786497252787461,
    "sentKBytesPerSec" : 2.26265553494487
  }
}