html-reports/spike/statistics.json
{
  "02 - Add To Cart" : {
    "transaction" : "02 - Add To Cart",
    "sampleCount" : 9096,
    "errorCount" : 3664,
    "errorPct" : 40.28144,
    "meanResTime" : 68.33410290237457,
    "medianResTime" : 68.0,
    "minResTime" : 2.0,
    "maxResTime" : 368.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 124.0,
    "pct3ResTime" : 216.03000000000065,
    "throughput" : 152.2852837769965,
    "receivedKBytesPerSec" : 162.9553040766784,
    "sentKBytesPerSec" : 36.61749683471455
  },
  "01 - Login for Token" : {
    "transaction" : "01 - Login for Token",
    "sampleCount" : 9108,
    "errorCount" : 3639,
    "errorPct" : 39.953888,
    "meanResTime" : 123.08574879227037,
    "medianResTime" : 115.0,
    "minResTime" : 2.0,
    "maxResTime" : 579.0,
    "pct1ResTime" : 200.0,
    "pct2ResTime" : 240.0,
    "pct3ResTime" : 391.0,
    "throughput" : 152.2491349480969,
    "receivedKBytesPerSec" : 192.4244228808318,
    "sentKBytesPerSec" : 20.533719002306803
  },
  "03 - Checkout Order" : {
    "transaction" : "03 - Checkout Order",
    "sampleCount" : 9082,
    "errorCount" : 3655,
    "errorPct" : 40.24444,
    "meanResTime" : 122.00891874036593,
    "medianResTime" : 116.0,
    "minResTime" : 2.0,
    "maxResTime" : 565.0,
    "pct1ResTime" : 200.0,
    "pct2ResTime" : 233.85000000000036,
    "pct3ResTime" : 363.1700000000001,
    "throughput" : 152.081449479219,
    "receivedKBytesPerSec" : 164.53678316734485,
    "sentKBytesPerSec" : 36.155592090115206
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 27286,
    "errorCount" : 10958,
    "errorPct" : 40.15979,
    "meanResTime" : 104.47544528329614,
    "medianResTime" : 81.0,
    "minResTime" : 2.0,
    "maxResTime" : 579.0,
    "pct1ResTime" : 169.0,
    "pct2ResTime" : 209.0,
    "pct3ResTime" : 312.9900000000016,
    "throughput" : 456.1121976497334,
    "receivedKBytesPerSec" : 519.3743907809287,
    "sentKBytesPerSec" : 93.18642338649015
  }
}